delehub/Open-source-MCU-design-sharing/STC12系列代码模板/STC12C5A60S2_IIC.C
#include"MAIN.H"
#include"STC12C5A60S2_IIC.H"

sbit sda=P2^7;          //数据线
sbit scl=P2^6;          //时钟线



//**************************************************************************************************
//延时
//**************************************************************************************************
voiddelay(unsigned int time)              //int型数据为16位,所以最大值为65535            
 {
  unsigned int  i,j;                  //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)         //for循环,循环50*time次
     for(j=0;j<50;j++);       //for循环,循环50次
 }
//**************************************************************************************************
//启动(SCL为高，SDA由高变为低是一个开始条件)
//**************************************************************************************************
void start()  
{	
	sda=1;    //数据线置高,
	_nop_();  //延时
	scl=1;    //时钟线置高
	_nop_();  //延时
	sda=0;    //数据线置低,由高变低
	_nop_();  //延时
	scl=0;    //时钟线置低,准备发送或接收数据,总线进入忙状态(I2C总线在空闲状态时，SDA与SCL均被置高)
	_nop_();  //延时
}
//**************************************************************************************************
//停止（SCL为高，SDA由低变为高是一个结束条件）
//**************************************************************************************************
void stop()   
{
	sda=0;                   //数据线置低
	_nop_();                 //延时
	scl=1;                   //时钟线置高
	_nop_();                 //延时
	sda=1;                   //数据线置高，由低变高
	_nop_();                 //延时
}
//**************************************************************************************************
//检测应答(所有的地址和数据字都是以8bit,在第9个时钟周期，从器件发出"0"信号来作为收到一个字的应答信号)
//**************************************************************************************************
void checkACK()                   //主器件检测从器件是否返回应答
{
	scl=1;                        //时钟线置高
	_nop_();                      //延时
	while(sda==1);                //等待第9个时钟周期器件发出的响应信号"0"
	scl=0;                        //时钟线置低
	_nop_();                      //延时
}
//**************************************************************************************************
//发送应答(发送方为主器件，接收方为从器件，控制器作为从器件接收完1数据时，发送应答信号
//**************************************************************************************************
void sendACK(bit ACK)                   
{
    if(ACK)sda=1;            //如果i位为1则发送1,即发送"非应答信号"
      else sda=0;            //如果i位为0则发送0,即发送"应答信号"	
    scl=1;                   //时钟线置高,给一个脉冲
	_nop_();                 //延时
	scl=0;                   //时钟线置低
	_nop_();                 //延时
}
//**************************************************************************************************
//写一字节
//**************************************************************************************************
void send_byte(unsigned char date)       //写一个8位字
{
	unsigned char i,temp;                //定义局部变量
	temp=date;                   //待发8位数据赋予temp
	for(i=0;i<8;i++)             //循环8次，每次写入1位，从最高位开始发送
	{
        if(temp&0x80)sda=1;      //如果temp最高位为1则发送1
          else sda=0;            //如果temp最高位为0则发送0
	    _nop_();                 //延时
		scl=1;                   //给一个脉冲，发送sda当前这位数据
		_nop_();                 //延时,需大于4us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();                
		scl=0;                   //时钟线置低,准备下一脉冲
	    _nop_();                 //延时,需大于4.7us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();  
		temp=temp<<1;            //左移1位，准备好下1位待发送的数据
	}
	checkACK();                  //查询是否返回应答信号
}
//**************************************************************************************************
//读一字节
//**************************************************************************************************
unsigned char receive_byte()         //读一个8位字
{
	unsigned char i,temp;            //定义局部变量
	sda=1;                   //设置数据线为输入
	_nop_();                 //延时
	for(i=0;i<8;i++)         //循环8次，每次读取1位，从最高位开始接收
	{
		scl=1;               //给一脉冲，准备发送1位数据            
		_nop_();             //延时,需大于4us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();
		temp=(temp<<1)|sda;  //读取1位数据,放在temp最低位
		scl=0;               //准备给下1个脉冲
	    _nop_();             //延时,需大于4.7us(参考数据手册时序图) 
		_nop_();              
		_nop_();                 
		_nop_();                 
		_nop_();       
	}
	return temp;             //返回读取的8位数据
}
//**************************************************************************************************
//向某I2C器件的某字地址写一字节数据
//**************************************************************************************************
void write_word(unsigned char device_add,unsigned char word_add,unsigned char date)  //写进去一个存储数据
{
	start();                  //启动
	send_byte(device_add);    //选择从器件地址,RW位为0，即选择写命令
	send_byte(word_add);      //写字地址
	send_byte(date);          //写数据
	stop();                   //停止        
}
//**************************************************************************************************
//向某I2C器件的某字地址读一字节数据
//**************************************************************************************************
unsigned char read_word(unsigned char device_add,unsigned char word_add)   //读出一个存储的数据
{
	unsigned char date;
	start();                 //启动
	send_byte(device_add);   //选择从器件地址,RW位为0，即选择写命令
	send_byte(word_add);     //写字地址
	start();                 //启动
	send_byte(device_add+1); //选择从器件地址,RW位为1，即选择读命令
	date=receive_byte();     //读数据
    sendACK(1);              //发送非应答信号
	stop();                  //停止
	return date;             //返回读取结果数据	  0XA0外部EEPROM器件地址
}

